Repository: dyuta6/why_sup
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Welcome
tr: Hoş Geldiniz

# phoneLoginTitle
source: Phone Login
tr: Telefon ile Giriş

# phoneNumberLabel
source: Phone Number
tr: Telefon Numarası

# phoneNumberHelper
source: Please enter your phone number with country code
tr: Lütfen ülke kodu ile birlikte telefon numaranızı girin

# phoneLoginButton
source: Login with Phone
tr: Telefon ile Giriş Yap

# phoneEmptyError
source: Please enter your phone number
tr: Lütfen telefon numaranızı girin

source: OR
tr: VEYA

# anonymousLoginTitle
source: Anonymous Login
tr: Anonim Giriş

# anonymousLoginDesc
source: You can login anonymously without providing a phone number.
tr: Telefon numarası vermeden anonim olarak giriş yapabilirsiniz.

# anonymousLoginButton
source: Login Anonymously
tr: Anonim Olarak Giriş Yap

# smsDialogTitle
source: SMS Verification
tr: SMS Doğrulama

# smsCodeLabel
source: SMS Code
tr: SMS Kodu

# cancelButton
source: Cancel
tr: İptal

# verifyButton
source: Verify
tr: Doğrula

# smsEmptyError
source: Please enter the SMS code
tr: Lütfen SMS kodunu girin

# verificationIdMissingError
source: Verification code is missing
tr: Doğrulama kodu eksik

# invalidSmsCodeError
source: Invalid SMS code
tr: Geçersiz SMS kodu

# invalidVerificationIdError
source: Invalid verification code
tr: Geçersiz doğrulama kodu

# genericError
source: An error occurred
tr: Bir hata oluştu

# networkError
source: Network connection error
tr: Ağ bağlantısı hatası

# anonymousLoginDisabledError
source: Anonymous login is disabled
tr: Anonim giriş devre dışı

# loginFailedError
source: Login failed
tr: Giriş başarısız oldu

# nicknameTitle
source: Choose a Nickname
tr: Kullanıcı Adı Seçin

# nicknameLabel
source: Nickname
tr: Kullanıcı Adı

# nicknameEmptyError
source: Please enter a nickname
tr: Lütfen bir kullanıcı adı girin

# nicknameTakenError
source: This nickname is already taken. Please choose another one.
tr: Bu kullanıcı adı zaten kullanılıyor. Lütfen başka bir kullanıcı adı seçin.

# nicknameSaveError
source: An error occurred while saving the nickname. Please try again.
tr: Kullanıcı adı kaydedilirken bir hata oluştu. Lütfen tekrar deneyin.

# sessionClosedError
source: Session is not active. Please login again.
tr: Oturum açık değil. Lütfen tekrar giriş yapın.

# continueButton
source: Continue
tr: Devam Et

# logoutButton
source: Logout
tr: Çıkış Yap

# nicknameDescription
source: Choose a nickname that other users will see
tr: Diğer kullanıcıların sizi göreceği bir kullanıcı adı seçin

# profileImageTitle
source: Choose a Profile Image
tr: Profil Resmi Seçin

source: Select from Gallery
tr: Galeriden Seç

source: Skip for Now
tr: Şimdilik Geç

# profileImageEmptyError
source: Please select a profile image
tr: Lütfen bir profil resmi seçin

# profileImageSaveError
source: An error occurred while saving the profile image
tr: Profil resmi kaydedilirken bir hata oluştu

# imagePickError
source: An error occurred while picking image: {error}
tr: Resim seçilirken bir hata oluştu: {error}

source: Permission Required
tr: İzin Gerekli

# permissionDescription
source: Permission is required to share app usage data. Would you like to go to settings to grant permission?
tr: Uygulama kullanım verilerini paylaşabilmek için izin gerekiyor. Ayarlara giderek izin vermek ister misiniz?

source: Warning
tr: Uyarı

# permissionWarning
source: Without app usage permission, you won't be able to see other users' activities. Would you like to grant permission?
tr: Uygulama kullanım izni olmadan diğer kullanıcıların aktivitelerini göremezsiniz. İzin vermek ister misiniz?

source: Yes
tr: Evet

source: No
tr: Hayır

source: All Activities
tr: Tüm Aktiviteler

# followingActivities
source: Following
tr: Takip Edilenler

source: started using
tr: kullanmaya başladı

# minutesAgo
source: {minutes} minutes ago
tr: {minutes} dakika önce

# hoursAgo
source: {hours} hours ago
tr: {hours} saat önce

source: just now
tr: az önce

# daysAgo
source: {days} days ago
tr: {days} gün önce

# followButtonText
source: Follow
tr: Takip Et

# unfollowButtonText
source: Unfollow
tr: Takibi Bırak

source: started following
tr: takip etmeye başladı

source: stopped following
tr: takibi bıraktı

# noFollowing
source: You are not following anyone
tr: Hiç kimseyi takip etmiyorsunuz

# checkAllTab
source: Check the "All Activities" tab to follow other users
tr: Diğer kullanıcıları takip etmek için "Tüm Aktiviteler" sekmesine göz atın

# anonymousUser
source: Anonymous
tr: Anonim

source: Unknown App
tr: Bilinmeyen Uygulama

# noActivities
source: No activities shared yet
tr: Henüz hiç aktivite paylaşılmamış

source: Profile
tr: Profil

source: Profile Visibility
tr: Profil Görünürlüğü

# contactsTooltip
source: Follow from Contacts
tr: Rehberden takip et

# contactsAccessTitle
source: Contacts Access
tr: Rehber Erişimi

# contactsAccessDescription
source: WhySup wants to access your contacts to find and automatically follow people you know. This makes it easier to connect with friends who are already using the app.
tr: WhySup, rehberinizden kişileri bulup otomatik olarak takip etmek için rehberinize erişmek istiyor. Bu sayede tanıdığınız kişileri kolayca bulabilir ve takip edebilirsiniz.

source: Cancel
tr: İptal

source: Allow Access
tr: İzin Ver

# accessRequired
source: Permission Required
tr: İzin Gerekli

# contactsAccessSettingsDescription
source: You need to grant contacts permission. Would you like to open app settings?
tr: Rehber erişimi için izin vermeniz gerekiyor. İzin vermek için uygulama ayarlarını açmak ister misiniz?

source: Open Settings
tr: Ayarları Aç

# contactsAccessDenied
source: Cannot find your contacts without access permission
tr: Rehbere erişim izni olmadan kişileriniz bulunamaz

# contactsLoading
source: Getting contacts from your address book...
tr: Rehberdeki kişiler alınıyor...

# userNotFound
source: No logged in user found
tr: Giriş yapılmış bir kullanıcı bulunamadı

# noContactsFound
source: No contacts found in your address book
tr: Rehberde kayıtlı kişi bulunamadı

# noPhoneNumbersFound
source: No phone numbers found in your contacts
tr: Rehberde telefon numarası bulunamadı

# contactsFoundProcessing
source: Found {count} phone numbers. Matching...
tr: {count} telefon numarası bulundu. Eşleştiriliyor...

# contactsFollowed
source: Added {count} contacts to your following list
tr: {count} kişi rehberden takip listesine eklendi

# noContactsUsingApp
source: None of your contacts are using WhySup
tr: Rehberinizdeki hiç kimse WhySup kullanmıyor

# contactsReadError
source: Error reading contacts: {error}
tr: Rehber okuma sırasında hata: {error}

# contactsProcessError
source: Error processing contacts: {error}
tr: Rehber işlemi sırasında hata: {error}

# invalidPhoneFormat
source: Please enter a valid phone number with country code (e.g. +1...)
tr: Lütfen ülke kodu ile birlikte geçerli bir telefon numarası girin (örn: +1...)
